---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementWrongHost
source: html/9914a408-824e-e4ad-4109-00799a4a163d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementWrongHost Property

Area Reinforcement can be placed only in Structural Floors and straight Structural Walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaReinforcementWrongHost { get; }
```